;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! writeroom-mode)
(package! py-isort)
(package! protobuf-mode)
(package! py-yapf)
(package! calfw)
(package! rfc-mode)
(package! rainbow-identifiers)
(package! keyfreq)
(package! exec-path-from-shell)
(package! anki-editor)
(package! leetcode)
(package! pyim)
(package! ace-pinyin)
(package! org-analyzer)
(package! evil-pinyin)
(package! cnfonts)
