;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! writeroom-mode)
(package! org-pomodoro)
(package! py-isort)
(package! protobuf-mode)
(package! py-yapf)
(package! org-super-agenda)
(package! calfw)
(package! org-gcal)
(package! rfc-mode)
(package! applescript-mode)
(package! rainbow-identifiers)
